In [117]:
#Importing the necessary libraries
import pandas as pd
import numpy as np
import sqlite3
import scipy.stats as st
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [118]:
#viewing the tmdb movies data
import pandas as pd

tm_df = pd.read_csv(r"C:\Users\This pc\Documents\moringa_labs\phase-2\Phase2-project\datasets\tmdb.movies.csv")
tm_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [119]:
tm_df.shape

(26517, 10)

In [120]:
tm_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [121]:
tm_df.describe()

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [122]:
#checking for duplicates
tm_df.duplicated().sum()

0

In [123]:
#checking for null values
tm_df.isna().sum()

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [124]:
#viewimng the tn movie budgets dataset
tn_df = pd.read_csv(r"C:\Users\This pc\Documents\moringa_labs\phase-2\Phase2-project\datasets\tn.movie_budgets.csv")
tn_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [125]:
tn_df.shape

(5782, 6)

In [126]:
tn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [137]:
#checking for duplicates
tn_df.duplicated().sum()

0

In [138]:
#checking for null values
tn_df.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [127]:
#removing symbols from productionbudget, doemstic_gross and worldwide_gross columns
tn_df["production_budget"]=tn_df["production_budget"].str.replace('[$,]','',regex=True)
tn_df["worldwide_gross"]=tn_df["worldwide_gross"].str.replace('[$,]','',regex=True)
tn_df["domestic_gross"]=tn_df["domestic_gross"].str.replace('[$,]','',regex=True)

In [ ]:
cols = ["production_budget","domestic_gross","worldwide_gross"]

tn_df[cols] = (
    tn_df[cols].apply(lambda col: pd.to_numeric(
        col.astype(str).str.replace(r'[^0-9]', '', regex=True),
        errors='coerce'      
    ).astype("Int64"))       
)

In [132]:
#confriming that the columns have been converted to integers
tn_df.dtypes

id                    int64
release_date         object
movie                object
production_budget     Int64
domestic_gross        Int64
worldwide_gross       Int64
dtype: object

In [131]:
tn_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [ ]:
#combining the two datasets into a single dataframe

In [140]:
#Querying the IM database
#Establishin a connection to the databse
conn = sqlite3.connect("../notebooks/im.db")

In [141]:
query1 = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table""")

TypeError: read_sql() missing 1 required positional argument: 'con'